Autodesk.Revit.DB.Events.FileImportingEventArgs.Format
Identifies the import format, e.g. DWG or image.
Since:
2010

Autodesk.Revit.DB.Events.FileImportingEventArgs.Path
Path of the source file which is about to be imported.
Since:
2010

Autodesk.Revit.DB.Events.FileImportingEventArgs
The event arguments used by the FileImporting event.
Since:
2010